## INDIAN START UPS ECOSYSTEM ANALYSIS IN 2018-2021

## 1. BUSINESS UNDERSTANDING

Our Team, Santa Fe is trying to venture into the Indian Startup Ecosystem.  With numerous of successful enterprises earning the coveted "unicorn" label, India has become a favored investment destination. Our team will make an effort to respond by analyzing the data from 2018-2021 in order to focus our search for the best course of action for investment as a young organization.

## 2. DATA COLLECTION

Provided with 4 datasets - the first 2 are to be imported from LP1 database, one exits in onedrive and the other is found in Github Repository.

In [69]:
# DATA IMPORTS IN THE LP1 DATABASE
# 1. Install pyodbc and python-dotenv
%pip install pyodbc  
%pip install python-dotenv

Requirement already satisfied: pyodbc in c:\users\lenovo\anaconda3\lib\site-packages (4.0.34)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: python-dotenv in c:\users\lenovo\anaconda3\lib\site-packages (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [70]:
## Import all the necessary packages

import pyodbc                    #just installed with pip
from dotenv import dotenv_values #import the dotenv_values function from the dotenv package
import pandas as pd
import numpy as np
import warnings 
import matplotlib.pyplot as plt

# Set the display format for floats
pd.options.display.float_format = '{:.2f}'.format

warnings.filterwarnings('ignore')

In [71]:
# Load environment variables from .env file into a dictionary
environment_variables = dotenv_values('.env')


# Get the values for the credentials you set in the '.env' file
database = environment_variables.get("DATABASE")
server = environment_variables.get("SERVER")
username = environment_variables.get("USERNAME")
password = environment_variables.get("PASSWORD")


connection_string = f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

In [72]:
# Use the connect method of the pyodbc library and pass in the connection string.
# This will connect to the server and might take a few seconds to be complete. 
# Check your internet connection if it takes more time than necessary

connection = pyodbc.connect(connection_string)

In [73]:
# Now the sql query to get the data is what what you see below. 
# Note that you will not have permissions to insert delete or update this database table. 

query = "Select * from dbo.LP1_startup_funding2020"
data20 = pd.read_sql(query, connection)
data20.head()

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
0,Aqgromalin,2019.00,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.00,None,None
1,Krayonnz,2019.00,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.00,Pre-seed,None
2,PadCare Labs,2018.00,Pune,Hygiene management,Converting bio-hazardous waste to harmless waste,Ajinkya Dhariya,Venture Center,NaN,Pre-seed,None
3,NCOME,2020.00,New Delhi,Escrow,Escrow-as-a-service platform,Ritesh Tiwari,"Venture Catalysts, PointOne Capital",400000.00,None,None
4,Gramophone,2016.00,Indore,AgriTech,Gramophone is an AgTech platform enabling acce...,"Ashish Rajan Singh, Harshit Gupta, Nishant Mah...","Siana Capital Management, Info Edge",340000.00,None,None

In [74]:
data20.columns

Index(['Company_Brand', 'Founded', 'HeadQuarter', 'Sector', 'What_it_does',
       'Founders', 'Investor', 'Amount', 'Stage', 'column10'],
      dtype='object')

In [75]:
# Importing the Table 2.
query = "Select * from dbo.LP1_startup_funding2021"
data21 = pd.read_sql(query, connection)
data21.head()

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
0,Unbox Robotics,2019.00,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.00,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",None
2,Lead School,2012.00,Mumbai,EdTech,LEAD School offers technology based school tra...,"Smita Deorah, Sumeet Mehta","GSV Ventures, Westbridge Capital","$30,000,000",Series D
3,Bizongo,2015.00,Mumbai,B2B E-commerce,Bizongo is a business-to-business online marke...,"Aniket Deb, Ankit Tomar, Sachin Agrawal","CDC Group, IDG Capital","$51,000,000",Series C
4,FypMoney,2021.00,Gurugram,FinTech,"FypMoney is Digital NEO Bank for Teenagers, em...",Kapil Banwari,"Liberatha Kallat, Mukesh Yadav, Dinesh Nagpal","$2,000,000",Seed

In [76]:
data21.columns

Index(['Company_Brand', 'Founded', 'HeadQuarter', 'Sector', 'What_it_does',
       'Founders', 'Investor', 'Amount', 'Stage'],
      dtype='object')

In [77]:
# Second Data from one Drive
data19 = pd.read_csv('startup_funding2019.csv')

data19.head()

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.00,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C
2,Eduisfun,NaN,Mumbai,Edtech,It aims to make learning fun via games.,Jatin Solanki,"Deepak Parekh, Amitabh Bachchan, Piyush Pandey","$28,000,000",Fresh funding
3,HomeLane,2014.00,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D
4,Nu Genes,2004.00,Telangana,AgriTech,"It is a seed company engaged in production, pr...",Narayana Reddy Punyala,Innovation in Food and Agriculture (IFA),"$6,000,000",NaN

In [78]:
data19.columns

Index(['Company/Brand', 'Founded', 'HeadQuarter', 'Sector', 'What it does',
       'Founders', 'Investor', 'Amount($)', 'Stage'],
      dtype='object')

In [79]:
# 3rd Data Set from git hub respository
data18 = pd.read_csv('startup_funding2018.csv')

data18.head()

,Company Name,Industry,Round/Series,Amount,Location,About Company
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",A startup which aggregates milk from dairy far...
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India",Leading Online Loans Marketplace in India
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India",PayMe India is an innovative FinTech organizat...
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India",Eunimart is a one stop solution for merchants ...

In [80]:
data18.columns

Index(['Company Name', 'Industry', 'Round/Series', 'Amount', 'Location',
       'About Company'],
      dtype='object')

## 3.HYPOTHESIS FORMULATION

Null Hypotheis - The tech sector doesnt have highest Sucess rate of being funded.

Alternative Hypothesis - The tech Sector has highest success rate of being funded  and investors should venture in the Tech Industry in Indian.

## 4. QUESTIONS

The following questions were asked to assist in the data analysis process:

1. Which company has the highest funding?
2. Which sector has the highest funding?
3. Who are the top 10 investors and the sectors have they invested in?
4. What is total amount of funding received in each year?
5. The top funded sector in the years 2018, 2019, 2020 and 2021.
6. Which is location recieved most funding?
7. At what stage do start up recieve most funding?

## 5. DATA CLEANING

### 1. Cleaning the 2018 dataset

In [81]:
# Cleaning the 2019 dataset
data18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   526 non-null    object
 1   Industry       526 non-null    object
 2   Round/Series   526 non-null    object
 3   Amount         526 non-null    object
 4   Location       526 non-null    object
 5   About Company  526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

### I. Dropping the columns not needed for analysis

In [82]:
# Dropping the 'About' columns since it is not present in the other datasets
data18 = data18.drop('About Company', axis=1)
data18.head()

,Company Name,Industry,Round/Series,Amount,Location
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India"
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India"
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India"
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India"
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India"

### II. Check for duplicates in the dataset

In [83]:
# Check for duplicates
duplicates = data18.duplicated(keep=False)

# Returns the total number of duplicates
duplicates_count = duplicates.value_counts()
duplicates_count

False    524
True       2
dtype: int64

In [84]:
# Identifying the duplicate rows
duplicates = data18[data18.duplicated(keep=False)]
duplicates

,Company Name,Industry,Round/Series,Amount,Location
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India"
348,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India"

##### We can see there is only one duplicated row, let's drop the row

In [85]:
# Dropping one of the duplicated row
data18.drop_duplicates(keep='first', inplace=True)

In [86]:
# Confirm if the duplicate rows have been dropped
duplicates = data18[data18.duplicated(keep=False)]
duplicates

Empty DataFrame
Columns: [Company Name, Industry, Round/Series, Amount, Location]
Index: []

### III. Check for missing values

In [87]:
missing_values_data18 = data18.isnull().sum()
missing_values_data18

Company Name    0
Industry        0
Round/Series    0
Amount          0
Location        0
dtype: int64

#### We can see that there are no missing values. But missing values can be represented using '-', let's check

In [88]:
# Replacing '-' with NaN
data18.replace("—", np.nan, inplace=True)

# Check for missing values
missing_values_data18 = data18.isnull().sum()
missing_values_data18

Company Name      0
Industry         30
Round/Series      0
Amount          148
Location          0
dtype: int64

#### Now we can see that we have a lot of missing values. Let's try dealing with the missing values

In [89]:
# Cleaning the 'Industry' column by replacing the missing values with 'Unknown'
data18['Industry'] = data18['Industry'].fillna('Unknown')
data18.head(10)

,Company Name,Industry,Round/Series,Amount,Location
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India"
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India"
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India"
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India"
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,NaN,"Hyderabad, Andhra Pradesh, India"
5,Hasura,"Cloud Infrastructure, PaaS, SaaS",Seed,1600000,"Bengaluru, Karnataka, India"
6,Tripshelf,"Internet, Leisure, Marketplace",Seed,"₹16,000,000","Kalkaji, Delhi, India"
7,Hyperdata.IO,Market Research,Angel,"₹50,000,000","Hyderabad, Andhra Pradesh, India"
8,Freightwalla,"Information Services, Information Technology",Seed,NaN,"Mumbai, Maharashtra, India"
9,Microchip Payments,Mobile Payments,Seed,NaN,"Bangalore, Karnataka, India"

In [90]:
# Replace '$' currency symbol and commas with empty string
data18['Amount'] = data18['Amount'].str.replace(',', '', regex=False).str.replace('$', '', regex=False)

# Cleaning the 'Amount' column by converting Indian Rupees to USD
data18.loc[data18['Amount'].astype(str).str.contains('₹'), 'Amount'] = data18.loc[data18['Amount'].astype(str).str.contains('₹'),'Amount'].apply(lambda x: float(x.replace('₹', ''))*0.012)

# Converting the 'Amount' column to numeric datatype, replacing any non-numeric values with NaN
data18['Amount'] = pd.to_numeric(data18['Amount'], errors='coerce')

# Rename column "Amount" to "Amount($)"
data18.rename(columns={'Amount':'Amount($)'}, inplace=True)

# Convert Amount($) column from object to float datatype
data18['Amount($)'] = data18['Amount($)'].astype(float)

data18

,Company Name,Industry,Round/Series,Amount($),Location
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,"Bangalore, Karnataka, India"
1,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,"Mumbai, Maharashtra, India"
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,"Gurgaon, Haryana, India"
3,PayMe India,"Financial Services, FinTech",Angel,2000000.00,"Noida, Uttar Pradesh, India"
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,NaN,"Hyderabad, Andhra Pradesh, India"
...,...,...,...,...,...
521,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000.00,"Bangalore, Karnataka, India"
522,Happyeasygo Group,"Tourism, Travel",Series A,NaN,"Haryana, Haryana, India"
523,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500.00,"Mumbai, Maharashtra, India"
524,Droni Tech,Information Technology,Seed,420000.00,"Mumbai, Maharashtra, India"
525,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000.00,"Chennai, Tamil Nadu, India"

In [91]:
# Replace NaN values in 'Amount($)' column with median
# Calculate the median of 'Amount($)' column
mean_amount = data18['Amount($)'].mean()

# Replacing NaN with the mean
data18['Amount($)'].fillna(value=mean_amount, inplace=True)

data18

,Company Name,Industry,Round/Series,Amount($),Location
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,"Bangalore, Karnataka, India"
1,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,"Mumbai, Maharashtra, India"
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,"Gurgaon, Haryana, India"
3,PayMe India,"Financial Services, FinTech",Angel,2000000.00,"Noida, Uttar Pradesh, India"
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,17030531.59,"Hyderabad, Andhra Pradesh, India"
...,...,...,...,...,...
521,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000.00,"Bangalore, Karnataka, India"
522,Happyeasygo Group,"Tourism, Travel",Series A,17030531.59,"Haryana, Haryana, India"
523,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500.00,"Mumbai, Maharashtra, India"
524,Droni Tech,Information Technology,Seed,420000.00,"Mumbai, Maharashtra, India"
525,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000.00,"Chennai, Tamil Nadu, India"

In [92]:
# Creating a year column and filling with 2018
data18.insert(0,'Year', 2018)
data18.head()

,Year,Company Name,Industry,Round/Series,Amount($),Location
0,2018,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,"Bangalore, Karnataka, India"
1,2018,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,"Mumbai, Maharashtra, India"
2,2018,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,"Gurgaon, Haryana, India"
3,2018,PayMe India,"Financial Services, FinTech",Angel,2000000.00,"Noida, Uttar Pradesh, India"
4,2018,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,17030531.59,"Hyderabad, Andhra Pradesh, India"

In [93]:
# Cleaning the Location column by splitting at the commas
data18[["City", "State", "Country"]]= data18['Location'].str.split(',', expand=True)
data18

,Year,Company Name,Industry,Round/Series,Amount($),Location,City,State,Country
0,2018,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,"Bangalore, Karnataka, India",Bangalore,Karnataka,India
1,2018,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,"Mumbai, Maharashtra, India",Mumbai,Maharashtra,India
2,2018,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,"Gurgaon, Haryana, India",Gurgaon,Haryana,India
3,2018,PayMe India,"Financial Services, FinTech",Angel,2000000.00,"Noida, Uttar Pradesh, India",Noida,Uttar Pradesh,India
4,2018,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,17030531.59,"Hyderabad, Andhra Pradesh, India",Hyderabad,Andhra Pradesh,India
...,...,...,...,...,...,...,...,...,...
521,2018,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000.00,"Bangalore, Karnataka, India",Bangalore,Karnataka,India
522,2018,Happyeasygo Group,"Tourism, Travel",Series A,17030531.59,"Haryana, Haryana, India",Haryana,Haryana,India
523,2018,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500.00,"Mumbai, Maharashtra, India",Mumbai,Maharashtra,India
524,2018,Droni Tech,Information Technology,Seed,420000.00,"Mumbai, Maharashtra, India",Mumbai,Maharashtra,India
525,2018,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000.00,"Chennai, Tamil Nadu, India",Chennai,Tamil Nadu,India

In [94]:
# Dropping the Country and Location column as it is not needed for the analysis
columns_to_drop = ['Country','Location']
data18.drop(columns_to_drop, axis=1, inplace=True)
data18.head()

,Year,Company Name,Industry,Round/Series,Amount($),City,State
0,2018,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,Bangalore,Karnataka
1,2018,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,Mumbai,Maharashtra
2,2018,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,Gurgaon,Haryana
3,2018,PayMe India,"Financial Services, FinTech",Angel,2000000.00,Noida,Uttar Pradesh
4,2018,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,17030531.59,Hyderabad,Andhra Pradesh

In [95]:
# Check for missing values
data18.isna().sum()

Year            0
Company Name    0
Industry        0
Round/Series    0
Amount($)       0
City            0
State           0
dtype: int64

In [96]:
# Check the data types
data18.dtypes

Year              int64
Company Name     object
Industry         object
Round/Series     object
Amount($)       float64
City             object
State            object
dtype: object

In [97]:
# Inspecting the City and State columns
data18['City'].unique()

array(['Bangalore', 'Mumbai', 'Gurgaon', 'Noida', 'Hyderabad',
       'Bengaluru', 'Kalkaji', 'Delhi', 'India', 'Hubli', 'New Delhi',
       'Chennai', 'Mohali', 'Kolkata', 'Pune', 'Jodhpur', 'Kanpur',
       'Ahmedabad', 'Azadpur', 'Haryana', 'Cochin', 'Faridabad', 'Jaipur',
       'Kota', 'Anand', 'Bangalore City', 'Belgaum', 'Thane', 'Margão',
       'Indore', 'Alwar', 'Kannur', 'Trivandrum', 'Ernakulam',
       'Kormangala', 'Uttar Pradesh', 'Andheri', 'Mylapore', 'Ghaziabad',
       'Kochi', 'Powai', 'Guntur', 'Kalpakkam', 'Bhopal', 'Coimbatore',
       'Worli', 'Alleppey', 'Chandigarh', 'Guindy', 'Lucknow'],
      dtype=object)

In [98]:
# Replacing Bengaluru and Bangalore City with Bangalore
data18['City'] = data18['City'].str.replace('Bengaluru','Bangalore', case=False)
data18['City'] = data18['City'].str.replace('Bangalore City','Bangalore', case=False) 
data18['City'].unique()

array(['Bangalore', 'Mumbai', 'Gurgaon', 'Noida', 'Hyderabad', 'Kalkaji',
       'Delhi', 'India', 'Hubli', 'New Delhi', 'Chennai', 'Mohali',
       'Kolkata', 'Pune', 'Jodhpur', 'Kanpur', 'Ahmedabad', 'Azadpur',
       'Haryana', 'Cochin', 'Faridabad', 'Jaipur', 'Kota', 'Anand',
       'Belgaum', 'Thane', 'Margão', 'Indore', 'Alwar', 'Kannur',
       'Trivandrum', 'Ernakulam', 'Kormangala', 'Uttar Pradesh',
       'Andheri', 'Mylapore', 'Ghaziabad', 'Kochi', 'Powai', 'Guntur',
       'Kalpakkam', 'Bhopal', 'Coimbatore', 'Worli', 'Alleppey',
       'Chandigarh', 'Guindy', 'Lucknow'], dtype=object)

In [99]:
data18

,Year,Company Name,Industry,Round/Series,Amount($),City,State
0,2018,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.00,Bangalore,Karnataka
1,2018,Happy Cow Dairy,"Agriculture, Farming",Seed,480000.00,Mumbai,Maharashtra
2,2018,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,780000.00,Gurgaon,Haryana
3,2018,PayMe India,"Financial Services, FinTech",Angel,2000000.00,Noida,Uttar Pradesh
4,2018,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,17030531.59,Hyderabad,Andhra Pradesh
...,...,...,...,...,...,...,...
521,2018,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000.00,Bangalore,Karnataka
522,2018,Happyeasygo Group,"Tourism, Travel",Series A,17030531.59,Haryana,Haryana
523,2018,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500.00,Mumbai,Maharashtra
524,2018,Droni Tech,Information Technology,Seed,420000.00,Mumbai,Maharashtra
525,2018,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000.00,Chennai,Tamil Nadu

In [100]:
# Inspecting the Round/Series Column
data18['Round/Series'].unique()

array(['Seed', 'Series A', 'Angel', 'Series B', 'Pre-Seed',
       'Private Equity', 'Venture - Series Unknown', 'Grant',
       'Debt Financing', 'Post-IPO Debt', 'Series H', 'Series C',
       'Series E', 'Corporate Round', 'Undisclosed',
       'https://docs.google.com/spreadsheets/d/1x9ziNeaz6auNChIHnMI8U6kS7knTr3byy_YBGfQaoUA/edit#gid=1861303593',
       'Series D', 'Secondary Market', 'Post-IPO Equity',
       'Non-equity Assistance', 'Funding Round'], dtype=object)

### 2. Cleaning the 2019 dataset

In [101]:
data19.head(10)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.00,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C
2,Eduisfun,NaN,Mumbai,Edtech,It aims to make learning fun via games.,Jatin Solanki,"Deepak Parekh, Amitabh Bachchan, Piyush Pandey","$28,000,000",Fresh funding
3,HomeLane,2014.00,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D
4,Nu Genes,2004.00,Telangana,AgriTech,"It is a seed company engaged in production, pr...",Narayana Reddy Punyala,Innovation in Food and Agriculture (IFA),"$6,000,000",NaN
5,FlytBase,NaN,Pune,Technology,A drone automation platform,Nitin Gupta,Undisclosed,Undisclosed,NaN
6,Finly,NaN,Bangalore,SaaS,It builds software products that makes work si...,"Vivek AG, Veekshith C Rai","Social Capital, AngelList India, Gemba Capital...",Undisclosed,NaN
7,Kratikal,2013.00,Noida,Technology,It is a product-based cybersecurity solutions ...,"Pavan Kushwaha, Paratosh Bansal, Dip Jung Thapa","Gilda VC, Art Venture, Rajeev Chitrabhanu.","$1,000,000",Pre series A
8,Quantiphi,NaN,NaN,AI & Tech,It is an AI and big data services company prov...,Renuka Ramnath,Multiples Alternate Asset Management,"$20,000,000",Series A
9,Lenskart,2010.00,Delhi,E-commerce,It is a eyewear company,"Peyush Bansal, Amit Chaudhary, Sumeet Kapahi",SoftBank,"$275,000,000",Series G

In [102]:
data19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        60 non-null     float64
 2   HeadQuarter    70 non-null     object
 3   Sector         84 non-null     object
 4   What it does   89 non-null     object
 5   Founders       86 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     object
 8   Stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

#### I. Dropping columns not needed for analysis

In [103]:
# Dropping the columns not needed for analysis
columns_to_drop = ['What it does', 'Founded', 'Founders', 'Investor']  #Founded?
data19.drop(columns_to_drop, axis = 1, inplace=True)
data19

,Company/Brand,HeadQuarter,Sector,Amount($),Stage
0,Bombay Shaving,NaN,Ecommerce,"$6,300,000",NaN
1,Ruangguru,Mumbai,Edtech,"$150,000,000",Series C
2,Eduisfun,Mumbai,Edtech,"$28,000,000",Fresh funding
3,HomeLane,Chennai,Interior design,"$30,000,000",Series D
4,Nu Genes,Telangana,AgriTech,"$6,000,000",NaN
...,...,...,...,...,...
84,Infra.Market,Mumbai,Infratech,"$20,000,000",Series A
85,Oyo,Gurugram,Hospitality,"$693,000,000",NaN
86,GoMechanic,Delhi,Automobile & Technology,"$5,000,000",Series B
87,Spinny,Delhi,Automobile,"$50,000,000",NaN
88,Ess Kay Fincorp,Rajasthan,Banking,"$33,000,000",NaN

#### II. Checking for duplicates

In [104]:
# Check for duplicates
duplicates = data19.duplicated(keep=False)

# Returns the total number of duplicates
duplicates_count = duplicates.value_counts()
duplicates_count

False    89
dtype: int64

#### III. Checking for missing values

In [105]:
# Check for the missing
data19.isnull().sum()

Company/Brand     0
HeadQuarter      19
Sector            5
Amount($)         0
Stage            46
dtype: int64

##### The aren't many missing values so let's try inspecting them

In [106]:
# Cleaning the Headquater column
data19['HeadQuarter'].unique()

array([nan, 'Mumbai', 'Chennai', 'Telangana', 'Pune', 'Bangalore',
       'Noida', 'Delhi', 'Ahmedabad', 'Gurugram', 'Haryana', 'Chandigarh',
       'Jaipur', 'New Delhi', 'Surat', 'Uttar pradesh', 'Hyderabad',
       'Rajasthan'], dtype=object)

In [107]:
# Replacing the 'nan' with 'Unknown'
data19['HeadQuarter'] = data19['HeadQuarter'].fillna('Unknown')
data19['HeadQuarter'].unique()

array(['Unknown', 'Mumbai', 'Chennai', 'Telangana', 'Pune', 'Bangalore',
       'Noida', 'Delhi', 'Ahmedabad', 'Gurugram', 'Haryana', 'Chandigarh',
       'Jaipur', 'New Delhi', 'Surat', 'Uttar pradesh', 'Hyderabad',
       'Rajasthan'], dtype=object)

In [108]:
# Cleaning the Sector column
data19['Sector'].unique()

array(['Ecommerce', 'Edtech', 'Interior design', 'AgriTech', 'Technology',
       'SaaS', 'AI & Tech', 'E-commerce', 'E-commerce & AR', 'Fintech',
       'HR tech', 'Food tech', 'Health', 'Healthcare', 'Safety tech',
       'Pharmaceutical', 'Insurance technology', 'AI', 'Foodtech', 'Food',
       'IoT', 'E-marketplace', 'Robotics & AI', 'Logistics', 'Travel',
       'Manufacturing', 'Food & Nutrition', 'Social Media', nan,
       'E-Sports', 'Cosmetics', 'B2B', 'Jewellery', 'B2B Supply Chain',
       'Games', 'Food & tech', 'Accomodation', 'Automotive tech',
       'Legal tech', 'Mutual Funds', 'Cybersecurity', 'Automobile',
       'Sports', 'Healthtech', 'Yoga & wellness', 'Virtual Banking',
       'Transportation', 'Transport & Rentals',
       'Marketing & Customer loyalty', 'Infratech', 'Hospitality',
       'Automobile & Technology', 'Banking'], dtype=object)

In [109]:
# Replacing nan in Sector column with Unknown
data19['Sector'] = data19['Sector'].fillna('Unknown')
data19

,Company/Brand,HeadQuarter,Sector,Amount($),Stage
0,Bombay Shaving,Unknown,Ecommerce,"$6,300,000",NaN
1,Ruangguru,Mumbai,Edtech,"$150,000,000",Series C
2,Eduisfun,Mumbai,Edtech,"$28,000,000",Fresh funding
3,HomeLane,Chennai,Interior design,"$30,000,000",Series D
4,Nu Genes,Telangana,AgriTech,"$6,000,000",NaN
...,...,...,...,...,...
84,Infra.Market,Mumbai,Infratech,"$20,000,000",Series A
85,Oyo,Gurugram,Hospitality,"$693,000,000",NaN
86,GoMechanic,Delhi,Automobile & Technology,"$5,000,000",Series B
87,Spinny,Delhi,Automobile,"$50,000,000",NaN
88,Ess Kay Fincorp,Rajasthan,Banking,"$33,000,000",NaN

In [110]:
# Cleaning the Stage column 
data19['Stage'] = data19['Stage'].fillna('Unavailable')
data19

,Company/Brand,HeadQuarter,Sector,Amount($),Stage
0,Bombay Shaving,Unknown,Ecommerce,"$6,300,000",Unavailable
1,Ruangguru,Mumbai,Edtech,"$150,000,000",Series C
2,Eduisfun,Mumbai,Edtech,"$28,000,000",Fresh funding
3,HomeLane,Chennai,Interior design,"$30,000,000",Series D
4,Nu Genes,Telangana,AgriTech,"$6,000,000",Unavailable
...,...,...,...,...,...
84,Infra.Market,Mumbai,Infratech,"$20,000,000",Series A
85,Oyo,Gurugram,Hospitality,"$693,000,000",Unavailable
86,GoMechanic,Delhi,Automobile & Technology,"$5,000,000",Series B
87,Spinny,Delhi,Automobile,"$50,000,000",Unavailable
88,Ess Kay Fincorp,Rajasthan,Banking,"$33,000,000",Unavailable

In [111]:
# Cleaning the amount column
# Replace currency symbol and commas with empty string
data19['Amount($)'] = data19['Amount($)'].str.replace(',', '', regex=False).str.replace('$', '', regex=False)

# Convert 'Amount' column to numeric datatype, replacing any non-numeric values.
data19['Amount($)'] = pd.to_numeric(data19['Amount($)'], errors='coerce')

# Convert Amount($) column from object to float datatype
data19['Amount($)'] = data19['Amount($)'].astype(float)

# The updated dataframe
data19.head(10)

    Company/Brand HeadQuarter           Sector    Amount($)          Stage
0  Bombay Shaving     Unknown        Ecommerce   6300000.00    Unavailable
1       Ruangguru      Mumbai           Edtech 150000000.00       Series C
2        Eduisfun      Mumbai           Edtech  28000000.00  Fresh funding
3        HomeLane     Chennai  Interior design  30000000.00       Series D
4        Nu Genes   Telangana         AgriTech   6000000.00    Unavailable
5        FlytBase        Pune       Technology          NaN    Unavailable
6           Finly   Bangalore             SaaS          NaN    Unavailable
7        Kratikal       Noida       Technology   1000000.00   Pre series A
8       Quantiphi     Unknown        AI & Tech  20000000.00       Series A
9        Lenskart       Delhi       E-commerce 275000000.00       Series G

In [112]:
# Replace NaN values in 'Amount($)' column with the mean
# Calculate the mean of Amount
median_amount = data19['Amount($)'].median()

# Replace NaN values with mean
data19['Amount($)'].fillna(median_amount, inplace=True)
data19.head(10)

    Company/Brand HeadQuarter           Sector    Amount($)          Stage
0  Bombay Shaving     Unknown        Ecommerce   6300000.00    Unavailable
1       Ruangguru      Mumbai           Edtech 150000000.00       Series C
2        Eduisfun      Mumbai           Edtech  28000000.00  Fresh funding
3        HomeLane     Chennai  Interior design  30000000.00       Series D
4        Nu Genes   Telangana         AgriTech   6000000.00    Unavailable
5        FlytBase        Pune       Technology   6000000.00    Unavailable
6           Finly   Bangalore             SaaS   6000000.00    Unavailable
7        Kratikal       Noida       Technology   1000000.00   Pre series A
8       Quantiphi     Unknown        AI & Tech  20000000.00       Series A
9        Lenskart       Delhi       E-commerce 275000000.00       Series G

In [113]:
# Check for missing values 
data19.isna().sum()

Company/Brand    0
HeadQuarter      0
Sector           0
Amount($)        0
Stage            0
dtype: int64

In [114]:
# Creating a year column and filling with 2019
data19.insert(0,'Year', 2019)
data19.head()

,Year,Company/Brand,HeadQuarter,Sector,Amount($),Stage
0,2019,Bombay Shaving,Unknown,Ecommerce,6300000.00,Unavailable
1,2019,Ruangguru,Mumbai,Edtech,150000000.00,Series C
2,2019,Eduisfun,Mumbai,Edtech,28000000.00,Fresh funding
3,2019,HomeLane,Chennai,Interior design,30000000.00,Series D
4,2019,Nu Genes,Telangana,AgriTech,6000000.00,Unavailable

#### 3. Cleaning 2020 Dataset

In [115]:
#cleaning the 2020 data
data20.head(10)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
0,Aqgromalin,2019.00,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.00,None,None
1,Krayonnz,2019.00,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.00,Pre-seed,None
2,PadCare Labs,2018.00,Pune,Hygiene management,Converting bio-hazardous waste to harmless waste,Ajinkya Dhariya,Venture Center,NaN,Pre-seed,None
3,NCOME,2020.00,New Delhi,Escrow,Escrow-as-a-service platform,Ritesh Tiwari,"Venture Catalysts, PointOne Capital",400000.00,None,None
4,Gramophone,2016.00,Indore,AgriTech,Gramophone is an AgTech platform enabling acce...,"Ashish Rajan Singh, Harshit Gupta, Nishant Mah...","Siana Capital Management, Info Edge",340000.00,None,None
5,qZense,2019.00,Bangalore,AgriTech,qZense Labs is building the next-generation Io...,"Rubal Chib, Dr Srishti Batra","Venture Catalysts, 9Unicorns Accelerator Fund",600000.00,Seed,None
6,MyClassboard,2008.00,Hyderabad,EdTech,MyClassboard is a full-fledged School / Colleg...,Ajay Sakhamuri,ICICI Bank.,600000.00,Pre-series A,None
7,Metvy,2018.00,Gurgaon,Networking platform,AI driven networking platform for individuals ...,Shawrya Mehrotra,HostelFund,NaN,Pre-series,None
8,Rupeek,2015.00,Bangalore,FinTech,Rupeek is an online lending platform that spec...,"Amar Prabhu, Ashwin Soni, Sumit Maniyar","KB Investment, Bertelsmann India Investments",45000000.00,Series C,None
9,Gig India,2017.00,Pune,Crowdsourcing,GigIndia is a marketplace that provides on-dem...,"Aditya Shirole, Sahil Sharma","Shantanu Deshpande, Subramaniam Ramadorai",1000000.00,Pre-series A,None

In [116]:
## check for Data Types
data20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1055 non-null   object
 1   Founded        842 non-null    float64
 2   HeadQuarter    961 non-null    object
 3   Sector         1042 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1043 non-null   object
 6   Investor       1017 non-null   object
 7   Amount         801 non-null    float64
 8   Stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.5+ KB

In [117]:
# Check for shape of the data
data20.shape

(1055, 10)

The data 2020 has 10 columns, where by two of the columns contains float entries and 8 others contains object entries

## 3.1 Drop columns not needed for analysis

In [118]:
#drop column 10,founders,investor,what it does,Founded, since it is needed for analysis
data20 = data20.drop('column10', axis=1)
data20 = data20.drop('Founders', axis=1)
data20 = data20.drop('Investor', axis = 1)
data20 = data20.drop('What_it_does', axis = 1)
data20 = data20.drop('Founded',axis = 1)

In [119]:
data20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1055 non-null   object
 1   HeadQuarter    961 non-null    object
 2   Sector         1042 non-null   object
 3   Amount         801 non-null    float64
 4   Stage          591 non-null    object
dtypes: float64(1), object(4)
memory usage: 41.3+ KB

The unnecessary columns have been dropped and now we have 5 columns left. Lets rename the columns to match with 2018 and 2019 data

In [121]:
#rename column names to make it consistent with the other data set
data20.rename(columns={'Company_Brand' : 'Company/Brand'}, inplace = True)

In [122]:
#The updated Dataframe for 2020
data20.head(10)

  Company/Brand HeadQuarter               Sector      Amount         Stage
0    Aqgromalin     Chennai             AgriTech   200000.00          None
1      Krayonnz   Bangalore               EdTech   100000.00      Pre-seed
2  PadCare Labs        Pune   Hygiene management         NaN      Pre-seed
3         NCOME   New Delhi               Escrow   400000.00          None
4    Gramophone      Indore             AgriTech   340000.00          None
5        qZense   Bangalore             AgriTech   600000.00          Seed
6  MyClassboard   Hyderabad               EdTech   600000.00  Pre-series A
7         Metvy     Gurgaon  Networking platform         NaN    Pre-series
8        Rupeek   Bangalore              FinTech 45000000.00      Series C
9     Gig India        Pune        Crowdsourcing  1000000.00  Pre-series A

## 3.2 Check for duplicates in the data set

In [123]:
#check for duplicates in the data20
duplicates = data20.duplicated(keep=False)

#returns the total number of duplicates
duplicates_count = duplicates.value_counts()
duplicates_count

False    1043
True       12
dtype: int64

In [124]:
#identify docuplicated rows
duplicates = data20[data20.duplicated(keep=False)]
duplicates

       Company/Brand HeadQuarter                 Sector       Amount Stage
120            Nykaa      Mumbai              Cosmetics          NaN  None
129        Krimanshi     Jodhpur  Biotechnology company    600000.00  Seed
145        Krimanshi     Jodhpur  Biotechnology company    600000.00  Seed
205            Nykaa      Mumbai              Cosmetics          NaN  None
215   Genius Teacher      Mumbai                 Edtech   2000000.00  None
233   Genius Teacher      Mumbai                 Edtech   2000000.00  None
326           Byju’s   Bangalore                 EdTech 500000000.00  None
362           Byju’s   Bangalore                 EdTech 500000000.00  None
771    Capital Float   Bangalore                Fintech  15000000.00  None
935             Byju        None                 Edtech 200000000.00  None
1014   Capital Float   Bangalore                Fintech  15000000.00  None
1035            Byju        None                 Edtech 200000000.00  None

In [126]:
#There are 12 duplicated rows
#drop duplicated rows
data20.drop_duplicates(keep='first', inplace= True)

In [127]:
#check if duplicates have been dropped
duplicates = data20[data20.duplicated(keep=False)]
duplicates

Empty DataFrame
Columns: [Company/Brand, HeadQuarter, Sector, Amount, Stage]
Index: []

## 3.3 Check for missing values

In [128]:
#checking for missing values in Data20
missing_values_data20 = data20.isnull().sum()
missing_values_data20

Company/Brand      0
HeadQuarter       93
Sector            13
Amount           253
Stage            459
dtype: int64

Handling Missing values columnwise

In [129]:
#replace missing values in 'Sector' column with 'Unknown'
data20['Sector'] = data20['Sector'].fillna('Unknown')
data20.head(10)

  Company/Brand HeadQuarter               Sector      Amount         Stage
0    Aqgromalin     Chennai             AgriTech   200000.00          None
1      Krayonnz   Bangalore               EdTech   100000.00      Pre-seed
2  PadCare Labs        Pune   Hygiene management         NaN      Pre-seed
3         NCOME   New Delhi               Escrow   400000.00          None
4    Gramophone      Indore             AgriTech   340000.00          None
5        qZense   Bangalore             AgriTech   600000.00          Seed
6  MyClassboard   Hyderabad               EdTech   600000.00  Pre-series A
7         Metvy     Gurgaon  Networking platform         NaN    Pre-series
8        Rupeek   Bangalore              FinTech 45000000.00      Series C
9     Gig India        Pune        Crowdsourcing  1000000.00  Pre-series A

In [130]:
#It is assumed that the amounts are already in dollars.
#Rename 'Amount' column to 'Amount($)'
data20.rename(columns={'Amount' : 'Amount($)'}, inplace= True)
data20

     Company/Brand HeadQuarter              Sector   Amount($)       Stage
0       Aqgromalin     Chennai            AgriTech   200000.00        None
1         Krayonnz   Bangalore              EdTech   100000.00    Pre-seed
2     PadCare Labs        Pune  Hygiene management         NaN    Pre-seed
3            NCOME   New Delhi              Escrow   400000.00        None
4       Gramophone      Indore            AgriTech   340000.00        None
...            ...         ...                 ...         ...         ...
1050  Leverage Edu       Delhi              Edtech  1500000.00        None
1051         EpiFi        None             Fintech 13200000.00  Seed Round
1052       Purplle      Mumbai           Cosmetics  8000000.00        None
1053        Shuttl       Delhi           Transport  8043000.00    Series C
1054         Pando     Chennai            Logitech  9000000.00    Series A

[1049 rows x 5 columns]

In [131]:
#calculate mean of the 'Amount($)' column 
#Replace missing values in 'Amount($)' column with the median
median_value = data20['Amount($)'].median()

data20['Amount($)'].fillna(value = median_value,  inplace=True)

data20

     Company/Brand HeadQuarter              Sector   Amount($)       Stage
0       Aqgromalin     Chennai            AgriTech   200000.00        None
1         Krayonnz   Bangalore              EdTech   100000.00    Pre-seed
2     PadCare Labs        Pune  Hygiene management  3000000.00    Pre-seed
3            NCOME   New Delhi              Escrow   400000.00        None
4       Gramophone      Indore            AgriTech   340000.00        None
...            ...         ...                 ...         ...         ...
1050  Leverage Edu       Delhi              Edtech  1500000.00        None
1051         EpiFi        None             Fintech 13200000.00  Seed Round
1052       Purplle      Mumbai           Cosmetics  8000000.00        None
1053        Shuttl       Delhi           Transport  8043000.00    Series C
1054         Pando     Chennai            Logitech  9000000.00    Series A

[1049 rows x 5 columns]